/**
 * 验证类型定义
 * 定义好可以直接用type引用验证，可以用正则对象，或者一个函数
 */
export const datatype = {
  /** 手机号 */
  phone: /^1\d{10}$/,
  
  /** 邮箱 */
  email: /^[a-zA-Z0-9_-]+@[a-zA-Z0-9_-]+(\.[a-zA-Z0-9_-]+)+$/,
  
  /** 用户名（中文+英文） */
  username: /^[\u4E00-\u9FA5A-Za-z]+$/,
  
  /** 小数（最多两位） */
  double: /^\d+(\.\d{1,2})?$/,
  
  /** 车架号 */
  vin: /^[A-Z0-9]{17}$/,
  
  /** 整数 */
  int: /^(-?\d+)$/,
  
  /** 数字（包含小数） */
  number: /^(-?\d+)(\.\d+)?$/,
  
  /** 身份证号 */
  idCard: /^[1-9]\d{5}(18|19|20|(3\d))\d{2}((0[1-9])|(1[0-2]))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,
  
  /** 车牌号 */
  carNum: /^(([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A-Z](([0-9]{5}[DF])|([DF]([A-HJ-NP-Z0-9])[0-9]{4})))|([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A-Z][A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9挂学警港澳使领]))$/,
  
  /** 必填验证 */
  required: (val: string) => !val?.length
} 